app/controllers/answers_controller.rb

  def create
    @answer = Answer.new(answer_params)
      @answer.User_id = current_user.id
     @answer.question_id = params[:questionId]



    respond_to do |format|
      if @answer.save
---
INSERT INTO "answers" ("content", "User_id", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Fuck you too"], ["User_id", 1], ["question_id", 0], ["created_at", "2017-07-16 09:00:41.940201"], ["updated_at", "2017-07-16 09:00:41.940201"]]