app/controllers/home_controller.rb

	def mainPage

            @question = Question.new
            @questions = Question.all
            @answer=Answer.new
            @answers = Answer.all
---
SELECT "questions".* FROM "questions"
SELECT "answers".* FROM "answers"

  def profilePage

     @questions = Question.all

     @answers = Answer.all
---
SELECT "questions".* FROM "questions"
SELECT "answers".* FROM "answers"

   def upload_image
  	uploaded_file = params[:image]
  	filename = SecureRandom.hex + "." +uploaded_file.original_filename.split('.')[1]
  	filepath = Dir.pwd + "/public/uploads/" + filename
	File.open(filepath,'wb') do |file|
		file.write(uploaded_file.read())
	end

	current_user.profile_picture = filename
	current_user.save!
---
UPDATE "users" SET "profile_picture" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_picture", "24904f0a826b240c96f8262656764271.JPG"], ["updated_at", "2017-07-16 12:57:46.679935"], ["id", 1]]