app/controllers/questions_controller.rb

  def create
    @question = Question.new(question_params)
    @question.User_id = current_user.id

    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("question", "content", "User_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["question", "wtf?"], ["content", "Wtf"], ["User_id", 1], ["created_at", "2017-07-16 09:00:35.023288"], ["updated_at", "2017-07-16 09:00:35.023288"]]