app/controllers/upvote_answers_controller.rb

	def toggle_upvote
		@answer = Answer.find(params[:answer_id])
		upvoteAnswer = UpvoteAnswer.where(user: current_user, answer: @answer).first
		if upvoteAnswer
			upvoteAnswer.destroy!
				# return redirect_to '/'

			@is_upVotedA = false
		else
			UpvoteAnswer.create(user: current_user, answer: @answer)
---
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", nil]]
SELECT  "upvote_answers".* FROM "upvote_answers" WHERE "upvote_answers"."user_id" = 1 AND "upvote_answers"."answer_id" = 4  ORDER BY "upvote_answers"."id" ASC LIMIT 1
DELETE FROM "upvote_answers" WHERE "upvote_answers"."id" = ?  [["id", 1]]
INSERT INTO "upvote_answers" ("user_id", "answer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["answer_id", 4], ["created_at", "2017-07-16 11:08:25.969992"], ["updated_at", "2017-07-16 11:08:25.969992"]]