app/controllers/upvote_questions_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "upvote_questions".* FROM "upvote_questions" WHERE "upvote_questions"."user_id" = 1 AND "upvote_questions"."question_id" = 1  ORDER BY "upvote_questions"."id" ASC LIMIT 1
DELETE FROM "upvote_questions" WHERE "upvote_questions"."id" = ?  [["id", 1]]
INSERT INTO "upvote_questions" ("user_id", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["question_id", 1], ["created_at", "2017-07-16 10:45:37.054038"], ["updated_at", "2017-07-16 10:45:37.054038"]]
---
	def toggle_upvote
		@question = Question.find(params[:question_id])
		upvoteQuestion = UpvoteQuestion.where(user: current_user, question: @question).first
		if upvoteQuestion
			upvoteQuestion.destroy!
			# @is_liked = false
		else
			UpvoteQuestion.create(user: current_user, question: @question)